### Flight Price EDA

In [50]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline

In [51]:
df = pd.read_excel('./data/flight_price_prediction/flight_price.xlsx')
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [52]:
df.tail(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,No info,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,No info,11753

In [53]:
# get basic info about the data

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [54]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [55]:
df.describe(include='object')

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
count,10683,10683,10683,10683,10682,10683,10683,10683,10682,10683
unique,12,44,5,6,128,222,1343,368,5,10
top,Jet Airways,18/05/2019,Delhi,Cochin,DEL → BOM → COK,18:55,19:00,2h 50m,1 stop,No info
freq,3849,504,4537,4537,2376,233,423,550,5625,8345

In [56]:
### Feature Engineering 

df['Date'] = df['Date_of_Journey'].str.split('/').str[0]
df['Month'] = df['Date_of_Journey'].str.split('/').str[1]
df['Year'] = df['Date_of_Journey'].str.split('/').str[2]

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
 11  Date             10683 non-null  object
 12  Month            10683 non-null  object
 13  Year             10683 non-null  object
dtypes: int64(1), object(13)
memory usage: 1.1+ MB

In [58]:
df['Date'] = df['Date'].astype(int)
df['Month'] = df['Month'].astype(int)
df['Year'] = df['Year'].astype(int)

In [59]:
## Drop date of journey column

df.drop('Date_of_Journey', axis = 1, inplace=True)

In [60]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019

In [61]:
df['Arrival_hour'] = df['Arrival_Time'].str.split(' ').str[0].str.split(':').str[0]
df['Arrival_min'] = df['Arrival_Time'].str.split(' ').str[0].str.split(':').str[1]

In [62]:
df['Arrival_hour'] = df['Arrival_hour'].astype(int)
df['Arrival_min'] = df['Arrival_min'].astype(int)

In [63]:
df.drop('Arrival_Time', axis = 1, inplace=True)

In [64]:
df['Dep_hour'] = df['Dep_Time'].str.split(':').str[0]
df['Dep_min'] = df['Dep_Time'].str.split(':').str[1]

df['Dep_hour'] = df['Dep_hour'].astype(int)
df['Dep_min'] = df['Dep_min'].astype(int)

df.drop('Dep_Time', axis = 1, inplace=True)

In [65]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662,1,5,2019,13,15,5,50

In [66]:
df['Total_Stops'].value_counts()

Total_Stops
1 stop      5625
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
Name: count, dtype: int64

In [67]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [68]:
df[df['Total_Stops'].isna()]

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
9039,Air India,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480,6,5,2019,9,25,9,45

In [69]:
stop_dict = {"non-stop":0, "1 stop": 1, "2 stops": 2, "3 stops": 3, "4 stops": 4, np.nan:1}
df['Total_Stops'] = df['Total_Stops'].map(stop_dict)

In [70]:
type(df['Total_Stops'][0])

numpy.int64

In [71]:
df[df['Total_Stops'].isna()]

Empty DataFrame
Columns: [Airline, Source, Destination, Route, Duration, Total_Stops, Additional_Info, Price, Date, Month, Year, Arrival_hour, Arrival_min, Dep_hour, Dep_min]
Index: []

In [72]:
df['Total_Stops'].value_counts()

Total_Stops
1    5626
0    3491
2    1520
3      45
4       1
Name: count, dtype: int64

In [73]:
df.drop('Route', axis=1, inplace=True)
df.head(2)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,2h 50m,0,No info,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,7h 25m,2,No info,7662,1,5,2019,13,15,5,50

In [74]:
def get_min(value):
    hr = 0
    minute = 0
    value  = value.split(' ')
    for time_val in value:
        if 'h' in time_val:
            hr = int(time_val[:-1])
        elif 'm' in time_val:
            minute = int(time_val[:-1])
    total_min = hr*60 + minute 
    return total_min

In [75]:
df['Duration_in_min'] = df['Duration'].apply(get_min)

In [76]:
df['Airline'].value_counts()
# to reduce column when we do one hot encoding
mapper_dict = {"Multiple carriers Premium economy": "other",
               "Jet Airways Business": "other",
               "Vistara Premium economy": "other",
               "Trujet": "other"}
df['Airline'] = df['Airline'].replace(mapper_dict)

df['Airline'].value_counts()

Airline
Jet Airways          3849
IndiGo               2053
Air India            1752
Multiple carriers    1196
SpiceJet              818
Vistara               479
Air Asia              319
GoAir                 194
other                  23
Name: count, dtype: int64

In [77]:
df['Source'].value_counts()

Source
Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: count, dtype: int64

In [79]:
df['Additional_Info'].value_counts()

mapper_dict = {"1 Long layover": "other",
               "Change airports": "other",
               "Business class": "other",
               "No Info": "other",
               "1 Short layover":"other",
               "Red-eye flight":"other",
               "2 Long layover":"other"}
df['Additional_Info'] = df['Additional_Info'].replace(mapper_dict)

df['Additional_Info'].value_counts()

Additional_Info
No info                         8345
In-flight meal not included     1982
No check-in baggage included     320
other                             36
Name: count, dtype: int64

In [80]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder(drop='first')

In [81]:
encoded_df = pd.DataFrame(encoder.fit_transform(df[['Airline', 'Source', 'Destination', 'Additional_Info']]).toarray(), columns=encoder.get_feature_names_out())

In [82]:
final_df = pd.concat([df, encoded_df], axis=1)

In [84]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 35 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Airline                                       10683 non-null  object
 1   Source                                        10683 non-null  object
 2   Destination                                   10683 non-null  object
 3   Duration                                      10683 non-null  object
 4   Total_Stops                                   10683 non-null  int64
 5   Additional_Info                               10683 non-null  object
 6   Price                                         10683 non-null  int64
 7   Date                                          10683 non-null  int32
 8   Month                                         10683 non-null  int32
 9   Year                                          10683 non-null  int32
 10  Arrival_hour                                  10683 non-null  int32
 11  Arrival_min                                   10683 non-null  int32
 12  Dep_hour                                      10683 non-null  int32
 13  Dep_min                                       10683 non-null  int32
 14  Duration_in_min                               10683 non-null  int64
 15  Airline_Air India                             10683 non-null  float64
 16  Airline_GoAir                                 10683 non-null  float64
 17  Airline_IndiGo                                10683 non-null  float64
 18  Airline_Jet Airways                           10683 non-null  float64
 19  Airline_Multiple carriers                     10683 non-null  float64
 20  Airline_SpiceJet                              10683 non-null  float64
 21  Airline_Vistara                               10683 non-null  float64
 22  Airline_other                                 10683 non-null  float64
 23  Source_Chennai                                10683 non-null  float64
 24  Source_Delhi                                  10683 non-null  float64
 25  Source_Kolkata                                10683 non-null  float64
 26  Source_Mumbai                                 10683 non-null  float64
 27  Destination_Cochin                            10683 non-null  float64
 28  Destination_Delhi                             10683 non-null  float64
 29  Destination_Hyderabad                         10683 non-null  float64
 30  Destination_Kolkata                           10683 non-null  float64
 31  Destination_New Delhi                         10683 non-null  float64
 32  Additional_Info_No check-in baggage included  10683 non-null  float64
 33  Additional_Info_No info                       10683 non-null  float64
 34  Additional_Info_other                         10683 non-null  float64
dtypes: float64(20), int32(7), int64(3), object(5)
memory usage: 2.6+ MB

In [85]:
final_df.drop(['Airline', 'Source', 'Destination', 'Additional_Info'], axis=1, inplace=True)

In [86]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 31 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Duration                                      10683 non-null  object
 1   Total_Stops                                   10683 non-null  int64
 2   Price                                         10683 non-null  int64
 3   Date                                          10683 non-null  int32
 4   Month                                         10683 non-null  int32
 5   Year                                          10683 non-null  int32
 6   Arrival_hour                                  10683 non-null  int32
 7   Arrival_min                                   10683 non-null  int32
 8   Dep_hour                                      10683 non-null  int32
 9   Dep_min                                       10683 non-null  int32
 10  Duration_in_min                               10683 non-null  int64
 11  Airline_Air India                             10683 non-null  float64
 12  Airline_GoAir                                 10683 non-null  float64
 13  Airline_IndiGo                                10683 non-null  float64
 14  Airline_Jet Airways                           10683 non-null  float64
 15  Airline_Multiple carriers                     10683 non-null  float64
 16  Airline_SpiceJet                              10683 non-null  float64
 17  Airline_Vistara                               10683 non-null  float64
 18  Airline_other                                 10683 non-null  float64
 19  Source_Chennai                                10683 non-null  float64
 20  Source_Delhi                                  10683 non-null  float64
 21  Source_Kolkata                                10683 non-null  float64
 22  Source_Mumbai                                 10683 non-null  float64
 23  Destination_Cochin                            10683 non-null  float64
 24  Destination_Delhi                             10683 non-null  float64
 25  Destination_Hyderabad                         10683 non-null  float64
 26  Destination_Kolkata                           10683 non-null  float64
 27  Destination_New Delhi                         10683 non-null  float64
 28  Additional_Info_No check-in baggage included  10683 non-null  float64
 29  Additional_Info_No info                       10683 non-null  float64
 30  Additional_Info_other                         10683 non-null  float64
dtypes: float64(20), int32(7), int64(3), object(1)
memory usage: 2.2+ MB